In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.read_csv("data/train.csv")

In [3]:
df.shape

(891, 12)

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
dataset = pd.DataFrame(df,columns=['Survived','Pclass','Sex', 'SibSp', 'Parch', 'Fare', 'Embarked']) # 'Age'

In [6]:
dataset.head()

   Survived  Pclass     Sex  SibSp  Parch     Fare Embarked
0         0       3    male      1      0   7.2500        S
1         1       1  female      1      0  71.2833        C
2         1       3  female      0      0   7.9250        S
3         1       1  female      1      0  53.1000        S
4         0       3    male      0      0   8.0500        S

In [7]:
dataset[dataset.isna().any(axis=1)]

     Survived  Pclass     Sex  SibSp  Parch  Fare Embarked
61          1       1  female      0      0  80.0      NaN
829         1       1  female      0      0  80.0      NaN

In [8]:
dataset = dataset.dropna()

In [9]:
sex_types = dataset['Sex'].unique()

In [10]:
embarked_types = dataset['Embarked'].unique()

In [11]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder

# creating instance of labelencoder
labelencoder = LabelEncoder()

# Assigning numerical values and storing in another column
dataset['Sex'] = labelencoder.fit_transform(dataset['Sex'])
dataset.head()

# Assigning numerical values and storing in another column
dataset['Embarked'] = labelencoder.fit_transform(dataset['Embarked'])
dataset.head()

   Survived  Pclass  Sex  SibSp  Parch     Fare  Embarked
0         0       3    1      1      0   7.2500         2
1         1       1    0      1      0  71.2833         0
2         1       3    0      0      0   7.9250         2
3         1       1    0      1      0  53.1000         2
4         0       3    1      0      0   8.0500         2

In [12]:
X = dataset.drop('Survived', axis=1)
y = dataset['Survived']

In [13]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.20)

In [14]:
from sklearn.naive_bayes import BernoulliNB

from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score
# evaluate a logistic regression model using k-fold cross-validation
from numpy import mean
from numpy import std

classifier = BernoulliNB().fit(X_train, y_train)

cv = KFold(n_splits=10, random_state=1, shuffle=True)

# evaluate classifier
scores = cross_val_score(classifier, X_train, y_train, scoring='accuracy', cv=cv, n_jobs=-1)
# report performance
print('Accuracy: %.3f (%.3f)' % (mean(scores), std(scores)))

Accuracy: 0.789 (0.035)

In [15]:
y_pred = classifier.predict(X_test)

In [16]:
from sklearn.metrics import classification_report, confusion_matrix
print(confusion_matrix(y_test, y_pred))
print(classification_report(y_test, y_pred))

[[88 18]
 [23 49]]
              precision    recall  f1-score   support

           0       0.79      0.83      0.81       106
           1       0.73      0.68      0.71        72

    accuracy                           0.77       178
   macro avg       0.76      0.76      0.76       178
weighted avg       0.77      0.77      0.77       178

In [17]:
df_test = pd.read_csv("data/test.csv")
dataset_test = pd.DataFrame(df_test,columns=['Pclass','Sex', 'SibSp', 'Parch', 'Fare', 'Embarked']) # 'Age'

# Assigning numerical values and storing in another column
dataset_test['Sex'] = labelencoder.fit_transform(dataset_test['Sex'])

# Assigning numerical values and storing in another column
dataset_test['Embarked'] = labelencoder.fit_transform(dataset_test['Embarked'])

dataset_test.head()

   Pclass  Sex  SibSp  Parch     Fare  Embarked
0       3    1      0      0   7.8292         1
1       3    0      1      0   7.0000         2
2       2    1      0      0   9.6875         1
3       3    1      0      0   8.6625         2
4       3    0      1      1  12.2875         2

In [18]:
dataset_test[dataset_test.isna().any(axis=1)]

     Pclass  Sex  SibSp  Parch  Fare  Embarked
152       3    1      0      0   NaN         2

In [19]:
dataset_test['Fare'] = dataset_test['Fare'].fillna(0)

In [21]:
y_result = classifier.predict(dataset_test)
pd.Series(y_result).to_csv("result/data.csv")